src/cf/Enums/НастройкиРабочегоСтола.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>НастройкиРабочегоСтола</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВариантКомпоновки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВариантРабочегоСтола</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Масштаб</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СхемаРабочегоСтола</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФоновоеОбновление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦветоваяСхема</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/НастройкиРабочегоСтола/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает значение настройки по умолчанию.
// 
// Параметры:
//  Настройка - ПеречислениеСсылка.НастройкиРабочегоСтола.
// 
// Возвращаемое значение:
//  Любой - Значение настройки по умолчанию.
//
Функция ЗначениеНастройкиПоУмолчанию(Настройка) Экспорт
	
	Если Настройка = ФоновоеОбновление Тогда
		Возврат ?(ОбщегоНазначения.ИнформационнаяБазаФайловая(), Ложь, Истина);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Проверяет, является ли переданная строка идентификатором настройки.
// 
// Параметры:
//  ИдентификаторНастройки - Строка.
// 
// Возвращаемое значение:
//  Булево - Переданная строка является идентификатором настройки.
//
Функция ЭтоИдентификаторНастройки(ИдентификаторНастройки) Экспорт
	
	ЭтоИдентификаторНастройки = СтрНачинаетсяС(ИдентификаторНастройки, "НастройкиРабочегоСтола_");
	
	Возврат ЭтоИдентификаторНастройки;
	
КонецФункции

// Возвращает строковый идентификатор настройки.
// 
// Параметры:
//  Настройка - ПеречислениеСсылка.НастройкиРабочегоСтола.
// 
// Возвращаемое значение:
//  Строка - Строковый идентификатор настройки.
//  
Функция ИдентификаторНастройки(Настройка) Экспорт
	
	Если Настройка = ВариантКомпоновки Тогда
		
		ИдентификаторНастройки = "НастройкиРабочегоСтола_ВариантКомпоновки";
		
	ИначеЕсли Настройка = ВариантРабочегоСтола Тогда
		
		ИдентификаторНастройки = "НастройкиРабочегоСтола_ВариантРабочегоСтола";
		
	ИначеЕсли Настройка = Масштаб Тогда
		
		ИдентификаторНастройки = "НастройкиРабочегоСтола_Масштаб";
		
	ИначеЕсли Настройка = СхемаРабочегоСтола  Тогда
		
		ИдентификаторНастройки = "НастройкиРабочегоСтола_СхемаРабочегоСтола";
		
	ИначеЕсли Настройка = ФоновоеОбновление Тогда
		
		ИдентификаторНастройки = "НастройкиРабочегоСтола_ФоновоеОбновление";
		
	ИначеЕсли Настройка = ЦветоваяСхема Тогда
		
		ИдентификаторНастройки = "НастройкиРабочегоСтола_ЦветоваяСхема";
		
	Иначе
		
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Неизвестная настройка %1 (%2).'"),
			Настройка,
			ТипЗнч(Настройка));
		
	КонецЕсли;
	
	Возврат ИдентификаторНастройки;
	
КонецФункции

// Определяет настройку по строковому идентификатору.
// 
// Параметры:
//  ИдентификаторНастройки - Строка.
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.НастройкиРабочегоСтола - Настройка.
//
Функция НастройкаПоИдентификатору(ИдентификаторНастройки) Экспорт
	
	Если ИдентификаторНастройки = "НастройкиРабочегоСтола_ВариантКомпоновки" Тогда
		
		Настройка = ВариантКомпоновки;
		
	ИначеЕсли ИдентификаторНастройки = "НастройкиРабочегоСтола_ВариантРабочегоСтола" Тогда
		
		Настройка = ВариантРабочегоСтола;
		
	ИначеЕсли ИдентификаторНастройки = "НастройкиРабочегоСтола_Масштаб" Тогда
		
		Настройка = Масштаб;
		
	ИначеЕсли ИдентификаторНастройки = "НастройкиРабочегоСтола_СхемаРабочегоСтола"  Тогда
		
		Настройка = СхемаРабочегоСтола;
		
	ИначеЕсли ИдентификаторНастройки = "НастройкиРабочегоСтола_ФоновоеОбновление" Тогда
		
		Настройка = ФоновоеОбновление;
		
	ИначеЕсли ИдентификаторНастройки = "НастройкиРабочегоСтола_ЦветоваяСхема" Тогда
		
		Настройка = ЦветоваяСхема;
		
	Иначе
		
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Неизвестный идентификатор настройки %1 (%2).'"),
			ИдентификаторНастройки,
			ТипЗнч(ИдентификаторНастройки));
		
	КонецЕсли;
	
	Возврат Настройка;
	
КонецФункции

#КонецОбласти

#КонецЕсли
